{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_28", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "name": "input_28"}, "inbound_nodes": []}, {"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 500, 1], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "conv1d_23", "class_name": "Conv1D", "config": {"name": "conv1d_23", "trainable": true, "filters": 128, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_28", 0, 0, {}]], [["input_29", 0, 0, {}]]]}, {"name": "conv1d_24", "class_name": "Conv1D", "config": {"name": "conv1d_24", "trainable": true, "filters": 64, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_23", 0, 0, {}]], [["conv1d_23", 1, 0, {}]]]}, {"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 1], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv1d_24", 0, 0, {}], ["conv1d_24", 1, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_30", 0, 0, {}]]]}, {"name": "flatten_18", "class_name": "Flatten", "config": {"name": "flatten_18", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "flatten_17", "class_name": "Flatten", "config": {"name": "flatten_17", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"name": "concatenate_18", "class_name": "Concatenate", "config": {"name": "concatenate_18", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_18", 0, 0, {}], ["flatten_17", 0, 0, {}]]]}, {"name": "dropout_23", "class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}, {"name": "dropout_24", "class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}], "input_layers": [["input_28", 0, 0], ["input_29", 0, 0], ["input_30", 0, 0]], "output_layers": [["dense_30", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}