{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 250, 1], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "input_24", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 250, 1], "dtype": "float32", "sparse": false, "name": "input_24"}, "inbound_nodes": []}, {"name": "conv1d_19", "class_name": "Conv1D", "config": {"name": "conv1d_19", "trainable": true, "filters": 128, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_23", 0, 0, {}]], [["input_24", 0, 0, {}]]]}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "filters": 64, "kernel_size": [50], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]], [["conv1d_19", 1, 0, {}]]]}, {"name": "input_25", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, 1], "dtype": "float32", "sparse": false, "name": "input_25"}, "inbound_nodes": []}, {"name": "concatenate_14", "class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv1d_20", 0, 0, {}], ["conv1d_20", 1, 0, {}]]]}, {"name": "dense_23", "class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_25", 0, 0, {}]]]}, {"name": "flatten_15", "class_name": "Flatten", "config": {"name": "flatten_15", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"name": "flatten_14", "class_name": "Flatten", "config": {"name": "flatten_14", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dense_23", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "axis": -1}, "inbound_nodes": [[["flatten_15", 0, 0, {}], ["flatten_14", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "dense_24", "class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_24", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "units": 11, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}], "input_layers": [["input_23", 0, 0], ["input_24", 0, 0], ["input_25", 0, 0]], "output_layers": [["dense_25", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}